In [1]:
import warnings 
warnings.filterwarnings('ignore')
from IPython.core.interactiveshell import InteractiveShell
InteractiveShell.ast_node_interactivity = "all"
import pandas as pd

In [2]:
Titan = pd.read_csv("Titan.csv")
Titan.head(10)
Titan.shape
Titan.describe()
Titan.dtypes

   SALESPERSON  OldScheme  NewScheme
0            1         57         62
1            2        103        122
2            3         59         54
3            4         75         82
4            5         84         84
5            6         73         86
6            7         35         32
7            8        110        104
8            9         44         38
9           10         82        107

(30, 3)

       SALESPERSON   OldScheme   NewScheme
count    30.000000   30.000000   30.000000
mean     15.500000   68.033333   72.033333
std       8.803408   20.455980   24.062395
min       1.000000   28.000000   32.000000
25%       8.250000   54.000000   55.000000
50%      15.500000   67.000000   74.000000
75%      22.750000   81.500000   85.750000
max      30.000000  110.000000  122.000000

SALESPERSON    int64
OldScheme      int64
NewScheme      int64
dtype: object

In [3]:
Titan["OldScheme"].mean()*1000
Titan["NewScheme"].mean()*1000

68033.33333333333

72033.33333333333

In [4]:
Titan[['OldScheme','NewScheme']].describe()
Titan['OldScheme'] = Titan['OldScheme'] * 1000
Titan['NewScheme'] = Titan['NewScheme'] * 1000
Titan.columns = ['SalesPerson','OldScheme','NewScheme']
Titan.head()

        OldScheme   NewScheme
count   30.000000   30.000000
mean    68.033333   72.033333
std     20.455980   24.062395
min     28.000000   32.000000
25%     54.000000   55.000000
50%     67.000000   74.000000
75%     81.500000   85.750000
max    110.000000  122.000000

   SalesPerson  OldScheme  NewScheme
0            1      57000      62000
1            2     103000     122000
2            3      59000      54000
3            4      75000      82000
4            5      84000      84000

In [5]:
# 2 Use the five percent significance test over the data to 
#determine the p value to check new scheme has significantly raised outputs? (8 points)
import scipy.stats as stats
stats.ttest_rel(Titan["NewScheme"], Titan["OldScheme"])

Ttest_relResult(statistic=1.5559143823544377, pvalue=0.13057553961337662)

In [6]:
# hence P value is pvalue=0.13057553961337662

#3) What conclusion does the test (p-value) lead to? (2 points)

# since p value > 0.05, so we can accept null hypothesis and reject alternate hypothesis; 
#There is a significant change over after new scheme implemented in sales

In [7]:
# 4 a) The probability of a type 1 error? (2 points)

# Answer : Probability of Type I error = significant level = 0.05 or 5%

In [8]:
# 4 b) What is the p- value of the hypothesis test if we test for a difference of $5000? (8 points)
from math import sqrt
import scipy.stats as st

Titan["CompareSales"] = Titan["NewScheme"] - Titan["OldScheme"]
Titan.head()

comparesales_mean = Titan["CompareSales"].mean()
comparesales_mean

comparesales_std = Titan["CompareSales"].std()
comparesales_std

comparesales_se = comparesales_std/sqrt(30) # sample size is 30
comparesales_se

tstat = (comparesales_mean - 5000)/comparesales_se
tstat

p_value = 1- st.t.cdf(tstat, df=29) # df = n-1 = 30-1 = 29
p_value # p-value of avg diff more than 5000

   SalesPerson  OldScheme  NewScheme  CompareSales
0            1      57000      62000          5000
1            2     103000     122000         19000
2            3      59000      54000         -5000
3            4      75000      82000          7000
4            5      84000      84000             0

4000.0

14081.046199376151

2570.8355455569017

-0.38897859558860937

0.6499332543693357

In [9]:
#  c) Power of the test (5 points)

# since P value = 0.6499, and degree of freedom df = 29 

# finding t critical value using student t test
# define probability

from scipy.stats import t
from scipy.stats import norm
p = 0.6499
df = 29
# retrieve value <= probability
value = t.ppf(p, df)
print(value)
t_value = t.cdf(value, df)
print(t_value)

# finding t critical value using Gaussian 
# define probability
p = 0.6499
# retrieve value <= probability
value = norm.ppf(p)
print(value)
# confirm with cdf
t_value = norm.cdf(value)
print(t_value)

t_critical = t.ppf(1-0.05, 29)

t_critical

#finding xbar value
mu0 = 0
xbar = mu0 + t_critical * comparesales_se
xbar

t_stat = ( xbar - 5000 ) / comparesales_se
t_stat

st.t.cdf(t_stat, df=29) 

#Hence power od test value 0.40379725247943166

0.3888876925908805
0.6498999996651291
0.38505050131866764
0.6499

1.6991270265334972

4368.176156228719

-0.2457659514095497

0.40379725247943166